tamaygz/esp-rollaball-derby/clients/esp8266-sensor/src/main.cpp
    if (g_hasLedConfig) {
        doc["led_count"]      = g_savedLedConfig.ledCount;
        doc["led_pin"]        = g_savedLedConfig.pin;
        doc["led_brightness"] = g_savedLedConfig.brightness;

        const char* topo = "strip";
        switch (g_savedLedConfig.topology) {
            case LedTopology::RING:               topo = "ring"; break;
            case LedTopology::MATRIX_ZIGZAG:      topo = "matrix_zigzag"; break;
            case LedTopology::MATRIX_PROGRESSIVE:  topo = "matrix_progressive"; break;
            default: break;
        }
        doc["led_topology"] = topo;
    }

    if (g_savedLedConfig.hasDeviceColor) {
        doc["device_color_r"] = g_savedLedConfig.deviceColorR;
        doc["device_color_g"] = g_savedLedConfig.deviceColorG;
        doc["device_color_b"] = g_savedLedConfig.deviceColorB;
    }

    // Atomic write: write to temp file, then rename to avoid corruption.
    File f = LittleFS.open(STATE_TMP, "w");
    if (!f) {
        Serial.println("[STATE] Failed to write temp state file");
        return;
    }
    serializeJson(doc, f);
    f.close();

    // Remove old state file (ignore failure — it may not exist on first write).
    LittleFS.remove(STATE_FILE);
    if (!LittleFS.rename(STATE_TMP, STATE_FILE)) {
        Serial.println("[STATE] WARNING: rename failed — temp file remains");
        return;
    }

    g_stateDirty     = false;
    g_stateLastSave  = millis();
    Serial.println("[STATE] State saved");
}

// Mark state as dirty; actual write is debounced in loop().
static void markStateDirty() {
    g_stateDirty = true;
}

// Flush state to flash if dirty and debounce period has elapsed.
static void flushStateIfNeeded() {
    if (!g_stateDirty) return;
    unsigned long now = millis();
    if (now - g_stateLastSave >= STATE_SAVE_DEBOUNCE_MS) {
        saveState();
    }
}

// ─── mDNS Server Discovery ────────────────────────────────────────────────────
// Queries the LAN for _derby._tcp to auto-discover the game server.
// Returns true and fills host/port on success; false if no service found.

static bool discoverServer(String& host, uint16_t& port) {
    // Build a unique mDNS hostname: "derby-sensor-XXXX"
    char mdnsName[32];
    snprintf(mdnsName, sizeof(mdnsName), "derby-sensor-%04x", derbyChipSuffix16());

    if (!MDNS.begin(mdnsName)) {
        Serial.println("[mDNS] Failed to start responder");
        return false;
    }

    Serial.println("[mDNS] Querying for _derby._tcp ...");
    int n = MDNS.queryService("derby", "tcp");
    if (n <= 0) {
        Serial.println("[mDNS] No server found — falling back to config");
        return false;
    }

    // Pick the first result on the same subnet as the ESP32's WiFi interface.
    // Windows hosts can advertise mDNS from multiple adapters (e.g. WSL2 bridge),
    // so we must reject IPs that are unreachable from the sensor's subnet.
    IPAddress localIp = WiFi.localIP();
    IPAddress mask    = WiFi.subnetMask();

    // On ESP32, subnetMask() can return 0.0.0.0 immediately after connect while
    // DHCP is still settling. Fall back to /24 — covers virtually all home/office
    // networks and is enough to distinguish 192.168.x.x from 172.x.x.x.
    if ((uint32_t)mask == 0) {
        mask = IPAddress(255, 255, 255, 0);
        Serial.printf("[mDNS] Subnet mask not ready — assuming /24 (local IP: %s)\n",
                      localIp.toString().c_str());
    }

    uint32_t myNet = (uint32_t)localIp & (uint32_t)mask;
    Serial.printf("[mDNS] Local: %s  mask: %s  net: %d.%d.%d.%d  candidates: %d\n",
                  localIp.toString().c_str(), mask.toString().c_str(),
                  (myNet >> 24) & 0xFF, (myNet >> 16) & 0xFF,
                  (myNet >> 8) & 0xFF, myNet & 0xFF, n);

    for (int i = 0; i < n; i++) {
        IPAddress candidate = MDNS.IP(i);
        uint32_t candNet    = (uint32_t)candidate & (uint32_t)mask;
        Serial.printf("[mDNS] Candidate[%d]: %s  net match: %s\n",
                      i, candidate.toString().c_str(),
                      candNet == myNet ? "YES" : "NO");
        if (candNet == myNet) {
            host = candidate.toString();
            port = MDNS.port(i);
            Serial.printf("[mDNS] Selected server at %s:%u\n", host.c_str(), port);
            return true;
        }
    }

    Serial.println("[mDNS] No same-subnet server found — falling back to config");
    return false;
}

// ─── WiFiManager Save Callback ────────────────────────────────────────────────

static void onSaveParams() {
    strlcpy(g_serverIp,   param_ip->getValue(),   sizeof(g_serverIp));
    strlcpy(g_serverPort, param_port->getValue(),  sizeof(g_serverPort));
    strlcpy(g_playerName, param_name->getValue(),  sizeof(g_playerName));
    saveConfig();
}

// ─── HTTP Config Server ───────────────────────────────────────────────────────

// POST /config  { "server_ip": "...", "server_port": "3000", "player_name": "..." }
// Updates LittleFS config and schedules a reboot so the sensor reconnects to
// the new server.  Any omitted JSON fields keep their current values.
static void handleHttpConfig() {
    if (httpServer.method() != HTTP_POST) {
        httpServer.send(405, "application/json", "{\"error\":\"Method Not Allowed\"}");
        return;
    }

    String body = httpServer.arg("plain");
    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, body);
    if (err) {
        httpServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
    }

    bool changed = false;
    if (doc["server_ip"].is<const char*>()) {
        const char* serverIp = doc["server_ip"];
        if (strcmp(serverIp, g_serverIp) != 0) {
            strlcpy(g_serverIp, serverIp, sizeof(g_serverIp));
            changed = true;
        }
    }
    if (doc["server_port"].is<const char*>()) {
        const char* serverPort = doc["server_port"];
        if (strcmp(serverPort, g_serverPort) != 0) {
            strlcpy(g_serverPort, serverPort, sizeof(g_serverPort));
            changed = true;
        }
    }
    if (doc["player_name"].is<const char*>()) {
        const char* playerName = doc["player_name"];
        if (strcmp(playerName, g_playerName) != 0) {
            strlcpy(g_playerName, playerName, sizeof(g_playerName));
            changed = true;
        }
    }

    if (changed) {
        saveConfig();
        Serial.printf("[CFG] Remote update — ip=%s port=%s name=%s — rebooting\n",
                      g_serverIp, g_serverPort, g_playerName);
        httpServer.send(200, "application/json", "{\"ok\":true}");
        g_pendingRestart = true;
    } else {
        httpServer.send(200, "application/json", "{\"ok\":true,\"changed\":false}");
    }
}

// ─── Setup ────────────────────────────────────────────────────────────────────

void setup() {
    Serial.begin(SERIAL_BAUD);
    delay(100);
    Serial.println("\n[BOOT] Roll-a-Ball Derby — Sensor Client");

    sensors.begin();

    // Mount LittleFS; format if mount fails (first boot or corruption).
    if (!LittleFS.begin()) {
        Serial.println("[CFG] LittleFS mount failed — formatting...");
        LittleFS.format();
        if (!LittleFS.begin()) {
            Serial.println("[CFG] LittleFS mount failed after format — continuing without persistent config");
        }
    }
    loadConfig();
    loadState();

