tamaygz/esp-rollaball-derby/clients/esp8266-sensor/src/main.cpp
    // Initialise LEDs with saved config (from previous server session) or defaults.
    if (g_hasLedConfig) {
        ledManager.begin(g_savedLedConfig);
        wsClient.setLedMetadata(g_savedLedConfig.ledCount);
        statusLed.begin(g_savedLedConfig.pin);
        Serial.println("[BOOT] Using saved LED config from previous session");
    } else {
        ledManager.begin(ledConfigDefaults());
        wsClient.setLedMetadata(LED_DEFAULT_COUNT);
        statusLed.begin(LED_DEFAULT_PIN);
    }

    // ─── Serial Pre-Configure Window ──────────────────────────────────────────
    // The web flasher sends DERBY_CFG:{json}\n within 3 s of boot to pre-populate
    // server IP/port/name without requiring the WiFiManager captive portal.
    // The settings are saved to LittleFS exactly like the WiFiManager would; on
    // the next step WiFiManager picks them up as pre-filled defaults.
    Serial.println(F("[CFG] Serial pre-config window 3 s — send: DERBY_CFG:{...}"));
    {
        const unsigned long kWindowMs = 3000UL;
        unsigned long deadline = millis() + kWindowMs;
        String buf;
        buf.reserve(128);
        bool done = false;
        while (!done && millis() < deadline) {
            while (!done && Serial.available()) {
                char c = static_cast<char>(Serial.read());
                if (c == '\r') continue;
                if (c == '\n') {
                    if (buf.startsWith(F("DERBY_CFG:"))) {
                        String json = buf.substring(10);
                        JsonDocument doc;
                        DeserializationError err = deserializeJson(doc, json);
                        if (!err) {
                            if (doc["server_ip"  ].is<const char*>())
                                strlcpy(g_serverIp,   doc["server_ip"],   sizeof(g_serverIp));
                            if (doc["server_port"].is<const char*>())
                                strlcpy(g_serverPort, doc["server_port"], sizeof(g_serverPort));
                            if (doc["player_name"].is<const char*>())
                                strlcpy(g_playerName, doc["player_name"], sizeof(g_playerName));
                            saveConfig();
                            Serial.println(F("[CFG] DERBY_CFG_ACK:OK"));
                            done = true;
                        } else {
                            Serial.printf("[CFG] DERBY_CFG_ACK:ERR_JSON %s\n", err.c_str());
                        }
                    }
                    buf = "";
                } else if (buf.length() < 256) {
                    buf += c;
                }
            }
            if (!done) delay(1);   // yield to background tasks
        }
        if (!done) Serial.println(F("[CFG] Serial config window expired"));
    }

    // Build unique AP name: "Derby-Sensor-XXXX" using last 4 hex digits of chip ID.
    char apName[32];
    snprintf(apName, sizeof(apName), "%s%04X",
             WIFIMANAGER_AP_PREFIX, derbyChipSuffix16());

    // WiFiManager custom parameters — pre-filled from saved config.
    param_ip   = new WiFiManagerParameter("server_ip",   "Server IP",   g_serverIp,   39);
    param_port = new WiFiManagerParameter("server_port", "Server Port", g_serverPort,  5);
    param_name = new WiFiManagerParameter("player_name", "Player Name", g_playerName, 20);

    wifiManager.addParameter(param_ip);
    wifiManager.addParameter(param_port);
    wifiManager.addParameter(param_name);
    wifiManager.setSaveParamsCallback(onSaveParams);

    // If no saved credentials, open the captive-portal AP for 3 minutes.
    // If credentials are saved, connect automatically without opening the portal.
    wifiManager.setConfigPortalTimeout(180);

    Serial.printf("[WiFi] Auto-connecting (AP: %s if needed)\n", apName);
    if (!wifiManager.autoConnect(apName)) {
        // autoConnect() returns false on timeout; reboot and try again.
        Serial.println("[WiFi] autoConnect timed out — rebooting");
        ESP.restart();
    }

    Serial.printf("[WiFi] Connected — IP: %s\n", WiFi.localIP().toString().c_str());
    ledManager.setState(LedState::WIFI_ONLY);

    // Try mDNS autodiscovery first; fall back to stored config.
    String discoveredHost;
    uint16_t discoveredPort;
    if (discoverServer(discoveredHost, discoveredPort)) {
        wsClient.begin(discoveredHost.c_str(), discoveredPort, g_playerName, g_playerId);
    } else {
        uint16_t port = static_cast<uint16_t>(atoi(g_serverPort));
        wsClient.begin(g_serverIp, port, g_playerName, g_playerId);
    }

    // HTTP config server — lets the Node.js admin push new config without
    // needing to re-open the WiFiManager captive portal.
    httpServer.on("/config", handleHttpConfig);
    httpServer.begin();
    Serial.printf("[HTTP] Config server listening on port %d\n", HTTP_CONFIG_PORT);
}

// ─── Loop ─────────────────────────────────────────────────────────────────────

static bool s_wifiWasConnected = false;

void loop() {
    ledManager.loop();
    statusLed.loop();

    bool wifiOk = (WiFi.status() == WL_CONNECTED);

    if (!wifiOk) {
        if (s_wifiWasConnected) {
            s_wifiWasConnected = false;
            wsClient.onWiFiLost();
            Serial.println("[WiFi] Connection lost");
        }
        ledManager.setState(LedState::NO_WIFI);
        return;
    }

    if (!s_wifiWasConnected) {
        s_wifiWasConnected = true;
        Serial.printf("[WiFi] Reconnected — IP: %s\n", WiFi.localIP().toString().c_str());

        // Re-attempt mDNS discovery after WiFi reconnect in case server IP changed.
        String rediscoveredHost;
        uint16_t rediscoveredPort;
        if (discoverServer(rediscoveredHost, rediscoveredPort)) {
            wsClient.begin(rediscoveredHost.c_str(), rediscoveredPort, g_playerName, g_playerId);
        }
    }

#if defined(ESP8266)
    MDNS.update();
#endif
    httpServer.handleClient();

    // Reboot after the HTTP response has been flushed (flagged by handleHttpConfig).
    if (g_pendingRestart) {
        // Flush any pending state before restarting.
        if (g_stateDirty) saveState();
        delay(200);
        ESP.restart();
    }

    wsClient.loop();

    // ── Persist playerId when assigned/changed ───────────────────────────────
    {
        const String& currentId = wsClient.getPlayerId();
        if (currentId.length() > 0 && strcmp(g_playerId, currentId.c_str()) != 0) {
            strlcpy(g_playerId, currentId.c_str(), sizeof(g_playerId));
            markStateDirty();
            Serial.printf("[STATE] playerId changed: %s\n", g_playerId);
        }
    }

    // ── LED config hot-reload ────────────────────────────────────────────────
    LedConfig pendingCfg;
    if (wsClient.pollLedConfig(pendingCfg)) {
        ledManager.applyConfig(pendingCfg);
        wsClient.setLedMetadata(pendingCfg.ledCount);
        statusLed.setStripPin(pendingCfg.pin);
        // Persist the LED config so next boot starts with the correct setup.
        g_savedLedConfig = pendingCfg;
        g_hasLedConfig   = true;
        markStateDirty();
    }

    // ── LED test effect ──────────────────────────────────────────────────────
    LedTestEffectMessage pendingEffect;
    if (wsClient.pollTestEffect(pendingEffect)) {
        ledManager.playTestEffect(pendingEffect);
    }

    int points          = sensors.check();
    LocalEventType  lev = wsClient.pollLocalEvent();
    GlobalEventType gev = wsClient.pollGlobalEvent();

    if (wsClient.isConnected()) {
        ledManager.setState(LedState::WS_CONNECTED);

        // Global events: all devices react (countdown, lifecycle, winner).
        bool winnerEvent = false;
        switch (gev) {
            case GlobalEventType::COUNTDOWN_TICK: ledManager.onGlobalEvent(gev); statusLed.blink(600); break;
            case GlobalEventType::GAME_STARTED:   ledManager.onGlobalEvent(gev); statusLed.blink(500); break;
            case GlobalEventType::GAME_PAUSED:    ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::GAME_RESUMED:   ledManager.onGlobalEvent(gev); statusLed.blink(300); break;
            case GlobalEventType::GAME_RESET:     ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::WINNER_SELF:    ledManager.onGlobalEvent(gev); statusLed.blink(1000); winnerEvent = true; break;
            case GlobalEventType::WINNER_OTHER:   ledManager.onGlobalEvent(gev); winnerEvent = true; break;
            default: break;
        }

