tamaygz/esp-rollaball-derby/clients/esp8266-sensor/src/main.cpp
        // Device-local events: only the owning device reacts (scoring, rank, streaks).
        // Skip when a winner event fired — the winning score arrives in the same
        // WS batch and would immediately overwrite the rainbow/pulse effect.
        if (winnerEvent) lev = LocalEventType::NONE;
        switch (lev) {
            case LocalEventType::SCORE_PLUS1:   ledManager.onLocalEvent(lev); statusLed.blink(200); break;
            case LocalEventType::SCORE_PLUS2:   ledManager.onLocalEvent(lev); statusLed.blink(200); break;
            case LocalEventType::SCORE_PLUS3:   ledManager.onLocalEvent(lev); statusLed.blink(300); break;
            case LocalEventType::ZERO_ROLL:     ledManager.onLocalEvent(lev); break;
            case LocalEventType::TOOK_LEAD:     ledManager.onLocalEvent(lev); statusLed.blink(400); break;
            case LocalEventType::BECAME_LAST:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::STREAK_ZERO:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::STREAK_THREE:  ledManager.onLocalEvent(lev); statusLed.blink(400); break;
            default: break;
        }

        // Only send score events once a playerId has been assigned by the server.
        if (!wsClient.getPlayerId().isEmpty()) {
            if (points > 0) {
                Serial.printf("[SENSOR] Triggered: +%d\n", points);
                wsClient.sendScore(points);
            }
        } else if (points > 0) {
            Serial.printf("[SENSOR] Dropped trigger while waiting for player assignment: +%d\n", points);
        }
    } else {
        ledManager.setState(LedState::WIFI_ONLY);
        if (points > 0) {
            Serial.printf("[SENSOR] Dropped offline trigger: +%d\n", points);
        }
    }

    // ── Debounced state flush to LittleFS ────────────────────────────────────
    flushStateIfNeeded();
}
